<p style="font-size:30px; text-align:center; line-height:120%">
<br>
COMS W 4111-02 Fall 2020<br>
Introduction to Databases<br>
Homework 1c: Programming Track<br>

</p>

# Overview and Instructions

In this part of homework 1c, you will have to:
- Clean up data from the Lahman baseball database
- Write a sql query to get the career stats of a given player. 

__Assignment Due Date: Sunday, October 11, 11:59pm__

<hr style="height:2px">

## Part 0: Import Data + Database Connection

### Load the data:
- Download the .dump file provided in the assignment on courseworks
- Open workbench, click 'Data Import/Restore' under Management
- Select 'Import from Self-Contained File' and either provide the path in the text box to the .dump file or click on the three dots to the right to find the file
- Under "Defult Target Schema to Load into" click new and name the schema ```lahman2019```
- Click 'Start Import' on the bottom right to begin

### Connect to the schema you just created:

In [1]:
%load_ext sql
%sql mysql+pymysql://root:Zhr990512@@localhost/lahman2019

<hr style="height:2px">

## Part 1: Data Cleanup
Data cleanup: For each table we want you to clean, we have provided a list of changes you have to make. You should make these changes through sql workbench's table editor and using sql queries. In this part you will clean two tables: People and Batting. 


### You must have: 
- A brief explanation of why we asked you to make each change
- What change you made to the table
- Any queries you used to make the changes, either the ones you wrote or the Alter statements provided by SQL workbench's table editor. 
- Executed the test statements we provided
- The cleaned table's new create statement (after you finish all the changes) 

### Overview of Changes:

People Table 

   0. Primary Key (Explanation is given, but you still must add the key to your table yourself)
   1. Empty strings to NULLs
   2. Column typing
   3. isDead column
   4. deathDate and birthDate column

Batting Table

   1. Empty strings to NULLs
   2. Column typing
   3. Primary Key
   4. Foreign Key
   
### How to make the changes: 

__Using the Table Editor:__

When you hit apply, a popup will open displaying the ALTER statments sql generates. Copy the sql provided first and paste it into this notebook. Then you can apply the changes. This means that you are NOT executing the ALTER statements through your notebook. 


<img src="workbench_table_editor.png">

<img src="workbench_apply_changes.png">


__Using sql queries:__

Copy paste any queries that you write manually into the notebook as well!


<hr style="height:2px">

## People Table

### 0) Add a Primary Key (Solutions are given but make sure you still do this step in workbench!!)

#### Explanation

We want to add a Primary Key because we want to be able to uniquely identify rows within our data. A primary key is also an index, which allows us to locate data faster.

#### Change

I added a Primary Key on the playerID column and made the datatype VARCHAR(15)

#### SQL

~~~~sql
ALTER TABLE `lahman2017`.`fielding`
CHANGE COLUMN `playerID` `playerID` VARCHAR(15) NOT NULL ,
ADD PRIMARY KEY (`playerID`);
~~~~

#### Tests

In [2]:
%sql SHOW KEYS FROM people WHERE Key_name = 'PRIMARY'

 * mysql+pymysql://root:***@localhost/lahman2019
1 rows affected.

[('People', 0, 'PRIMARY', 1, 'playerID', 'A', 19960, None, None, '', 'BTREE', '', '', 'YES', None)]

### 1) Convert all empty strings to NULL

#### Explanation

We want to convert the original "nan" string in the tabke to NULL type so that we can conduct following operations.

#### Change

I set values in all columns except playerID to NULL is their value is "nan". NULLIF() is used in my queries. NULLIF(expr1, expr2) returns NULL if exrp1 is equal to expr2.

#### SQL

~~~~sql
update People
set birthYear = NULLIF(birthYear, "nan"), birthMonth = NULLIF(birthMonth, "nan"), birthDay = NULLIF(birthDay, "nan"),
birthCountry = NULLIF(birthCountry, "nan"), birthState= NULLIF(birthState, "nan"), birthCity = NULLIF(birthCity, "nan"),
deathYear = NULLIF(deathYear, "nan"), deathMonth = NULLIF(deathMonth, "nan"), deathDay = NULLIF(deathDay, "nan"), 
deathCountry = NULLIF(deathCountry, "nan"), deathState = NULLIF(deathState, "nan"), deathCity = NULLIF(deathCity, "nan"), 
nameFirst = NULLIF(nameFirst, "nan"), nameLast = NULLIF(nameLast, "nan"), nameGiven = NULLIF(nameGiven, "nan"),
weight = NULLIF(weight, "nan"), height = NULLIF(height, "nan"), bats = NULLIF(bats, "nan"),
throws = NULLIF(throws, "nan"), debut = NULLIF(debut, "nan"), finalGame = NULLIF(finalGame, "nan"),
retroID = NULLIF(retroID, "nan"), bbrefID = NULLIF(bbrefID, "nan");
~~~~

#### Tests

In [21]:
%sql SELECT * FROM people WHERE birthState = "nan"

 * mysql+pymysql://root:***@localhost/lahman2019
0 rows affected.

[]

### 2) Change column datatypes to appropriate values (ENUM, INT, VARCHAR, DATETIME, ETC)

#### Explanation

Setting the appropriate datatype for each column helps to organize the table. For example, in the original People table, birthYear is a decimal (e.g. 1981.0), which is obviously undersirable. Setting appropriate datatype makes it easy to look up in the table. Moreover, there are operators in the database that only recoginze certain datatype.

#### Change

Below are column names and their new datatypes with brief explanation of my choice of the appropriate datatype <br>
PlayerID: VARCHAR(15); this follows the example in 0) <br>
birthYear, deathYear: CHAR(4); obviously, year is of 4-char length. <br>
birthMonth/Day, deathMonth/Day: CHAR(2); obviously, month and day are of 2-char length. To unify the length, I zero-padded the values (e.g. 4 -> 04). <br>
birthCountry/State/City, deathCountry/State/City: VARCHAR(128); the length of country/state/city varies, so varchar was used. Max length of 128 makes sure all possible values can be fit into the table. <br>
nameFirst/Last/Given: VARCHAR(128); the length is also variant, so varchar is used. Max length of 128 makes sure all possible values can be fit into the table. <br>
weight: DECIMAL(5,1); the max length of weight in the table is 5 digits with 1 decimal digits. So decmial(5,1) is used. <br>
height: DECIMAL(3,1); the max length of height in the table is 3 digits with 1 decimal digits. So decmial(3,1) is used. <br>
bats: ENUM("L", "R", "B"); 3 possible values exist in the bats columns in the table, which are L, R, and B. So enum ("L", "R", "B") was used. <br>
throws: ENUM("L", "R", "S"); 3 possible values exist in the throws columns in the table, which are L, R, and S. So enum ("L", "R", "S") was used. <br>
debut, finalGame: DATE; obviously, these two columns contain the date of games, so date is the most reasonable choice. <br>
retroID, bbrefID: VARCHAR(10); the length of ID varies, so varchar is used. Longest ID in the table has length of 10, so setting max length to 10 makes sure all possible ID values can fit into the table

#### SQL

~~~~sql
update People
set birthYear = left(birthYear, 4), birthMonth = left(lpad(birthMonth, 4, "0"), 2), birthDay = left(lpad(birthDay, 4, "0"), 2),
deathYear = left(deathYear, 4),  deathMonth = left(lpad(deathMonth, 4, "0"), 2), deathDay = left(lpad(deathDay, 4, "0"), 2);

ALTER TABLE `lahman2019`.`People` 
CHANGE COLUMN `birthYear` `birthYear` CHAR(4) NULL DEFAULT NULL ,
CHANGE COLUMN `birthMonth` `birthMonth` CHAR(2) NULL DEFAULT NULL ,
CHANGE COLUMN `birthDay` `birthDay` CHAR(2) NULL DEFAULT NULL ,
CHANGE COLUMN `birthCountry` `birthCountry` VARCHAR(128) NULL DEFAULT NULL ,
CHANGE COLUMN `birthState` `birthState` VARCHAR(128) NULL DEFAULT NULL ,
CHANGE COLUMN `birthCity` `birthCity` VARCHAR(128) NULL DEFAULT NULL ,
CHANGE COLUMN `deathYear` `deathYear` CHAR(4) NULL DEFAULT NULL ,
CHANGE COLUMN `deathMonth` `deathMonth` CHAR(2) NULL DEFAULT NULL ,
CHANGE COLUMN `deathDay` `deathDay` CHAR(2) NULL DEFAULT NULL ,
CHANGE COLUMN `deathCountry` `deathCountry` VARCHAR(128) NULL DEFAULT NULL ,
CHANGE COLUMN `deathState` `deathState` VARCHAR(128) NULL DEFAULT NULL ,
CHANGE COLUMN `deathCity` `deathCity` VARCHAR(128) NULL DEFAULT NULL ,
CHANGE COLUMN `nameFirst` `nameFirst` VARCHAR(128) NULL DEFAULT NULL ,
CHANGE COLUMN `nameLast` `nameLast` VARCHAR(128) NULL DEFAULT NULL ,
CHANGE COLUMN `nameGiven` `nameGiven` VARCHAR(128) NULL DEFAULT NULL ,
CHANGE COLUMN `weight` `weight` DECIMAL(5,1) NULL DEFAULT NULL ,
CHANGE COLUMN `height` `height` DECIMAL(3,1) NULL DEFAULT NULL ,
CHANGE COLUMN `bats` `bats` ENUM("L", "R", "B") NULL DEFAULT NULL ,
CHANGE COLUMN `throws` `throws` ENUM("L", "R", "S") NULL DEFAULT NULL ,
CHANGE COLUMN `debut` `debut` DATE NULL DEFAULT NULL ,
CHANGE COLUMN `finalGame` `finalGame` DATE NULL DEFAULT NULL ,
CHANGE COLUMN `retroID` `retroID` VARCHAR(10) NULL DEFAULT NULL ,
CHANGE COLUMN `bbrefID` `bbrefID` VARCHAR(10) NULL DEFAULT NULL ;
~~~~

### 3) Add an isDead Column that is either 'Y' or 'N'
Some things to think of: What data type should this column be? How do you know if the player is dead or not?

'Y' means the player is dead

'N' means the player is alive

#### Explanation

isDead is a useful and direct attribute that tells if a play is alive or not. It could provide essential help for further operations on the table.

#### Change

First, I added a nullable column named "isDead" with datatype ENUM("Y", "N") <br>
To tell that a player is dead is easy -- simply check that any of {deathYear, deathMonth, deathDay, deathCountry, deathStae, deathCity} is not NULL. If any of them is not NULL, then the player is not dead.<br>
On the other hand, NULL in above fields can imply 1. the player is alive, 2. the player is dead but the deathYear is unknown or 3. we don't know whether the player is dead or not. Thus, it's hard to say for sure that a player is not dead by only looking at these fields. Therefore, I made the assumption that if all of the fields mentioned above are NULL, then it implies that the corresponding player is alive and isDead = "N".

#### SQL

~~~~sql
update People 
set isDead = 
case
	when deathYear is not null then "Y"
    when deathMonth is not null then "Y"
    when deathDay is not null then "Y"
    when deathCountry is not null then "Y"
    when deathState is not null then "Y"
    when deathCity is not null then "Y"
    else "N"
end;
~~~~

#### Tests

In [23]:
%sql SELECT * FROM people WHERE isDead = "N" limit 10

 * mysql+pymysql://root:***@localhost/lahman2019
10 rows affected.

[('aardsda01', '1981', '12', '27', 'USA', 'CO', 'Denver', None, None, None, None, None, None, 'David', 'Aardsma', 'David Allan', Decimal('215.0'), Decimal('75.0'), 'R', 'R', datetime.date(2004, 4, 6), datetime.date(2015, 8, 23), 'aardd001', 'aardsda01', 'N'),
 ('aaronha01', '1934', '02', '05', 'USA', 'AL', 'Mobile', None, None, None, None, None, None, 'Hank', 'Aaron', 'Henry Louis', Decimal('180.0'), Decimal('72.0'), 'R', 'R', datetime.date(1954, 4, 13), datetime.date(1976, 10, 3), 'aaroh101', 'aaronha01', 'N'),
 ('aasedo01', '1954', '09', '08', 'USA', 'CA', 'Orange', None, None, None, None, None, None, 'Don', 'Aase', 'Donald William', Decimal('190.0'), Decimal('75.0'), 'R', 'R', datetime.date(1977, 7, 26), datetime.date(1990, 10, 3), 'aased001', 'aasedo01', 'N'),
 ('abadan01', '1972', '08', '25', 'USA', 'FL', 'Palm Beach', None, None, None, None, None, None, 'Andy', 'Abad', 'Fausto Andres', Decimal('184.0'), Decimal('73.0'), 'L', 'L', datetime.date(2001, 9, 10), datetime.date(2006, 4, 13), 'abada001', 'abadan01', 'N'),
 ('abadfe01', '1985', '12', '17', 'D.R.', 'La Romana', 'La Romana', None, None, None, None, None, None, 'Fernando', 'Abad', 'Fernando Antonio', Decimal('235.0'), Decimal('74.0'), 'L', 'L', datetime.date(2010, 7, 28), datetime.date(2019, 9, 28), 'abadf001', 'abadfe01', 'N'),
 ('abbotgl01', '1951', '02', '16', 'USA', 'AR', 'Little Rock', None, None, None, None, None, None, 'Glenn', 'Abbott', 'William Glenn', Decimal('200.0'), Decimal('78.0'), 'R', 'R', datetime.date(1973, 7, 29), datetime.date(1984, 8, 8), 'abbog001', 'abbotgl01', 'N'),
 ('abbotje01', '1972', '08', '17', 'USA', 'GA', 'Atlanta', None, None, None, None, None, None, 'Jeff', 'Abbott', 'Jeffrey William', Decimal('190.0'), Decimal('74.0'), 'R', 'L', datetime.date(1997, 6, 10), datetime.date(2001, 9, 29), 'abboj002', 'abbotje01', 'N'),
 ('abbotji01', '1967', '09', '19', 'USA', 'MI', 'Flint', None, None, None, None, None, None, 'Jim', 'Abbott', 'James Anthony', Decimal('200.0'), Decimal('75.0'), 'L', 'L', datetime.date(1989, 4, 8), datetime.date(1999, 7, 21), 'abboj001', 'abbotji01', 'N'),
 ('abbotku01', '1969', '06', '02', 'USA', 'OH', 'Zanesville', None, None, None, None, None, None, 'Kurt', 'Abbott', 'Kurt Thomas', Decimal('180.0'), Decimal('71.0'), 'R', 'R', datetime.date(1993, 9, 7), datetime.date(2001, 4, 13), 'abbok002', 'abbotku01', 'N'),
 ('abbotky01', '1968', '02', '18', 'USA', 'MA', 'Newburyport', None, None, None, None, None, None, 'Kyle', 'Abbott', 'Lawrence Kyle', Decimal('200.0'), Decimal('76.0'), 'L', 'L', datetime.date(1991, 9, 10), datetime.date(1996, 8, 24), 'abbok001', 'abbotky01', 'N')]

### 4) Add a deathDate and birthDate column
Some things to think of: What do you do if you are missing information? What datatype should this column be?

#### Explanation

Both deathDate and birthDate combine several other useful columns together so that it will be easier to look up for the date of death/birth in the future. We only need to look up a single column rather than three.

#### Change

First, we added two nullable columns named "birthDate" and "deathDate" both with data type DATETIME because both date and time are included in the test results. <br>
Since time was not included in the original table, I appended "00:00:00" after concatenating birthYear, birthMonth, and birthDay with "-" to form birthDate. Since year, month and day are all required in the final formation of borthDate, birthDate was set to null if any of these three attributes is missing. DeathDate follows the same logic.

#### SQL

~~~~~sql
ALTER TABLE `lahman2019`.`People` 
ADD COLUMN `birthDate` DATETIME NULL DEFAULT NULL AFTER `isDead`,
ADD COLUMN `deathDate` DATETIME NULL DEFAULT NULL AFTER `birthDate`;

update People 
set birthDate = timestamp(concat_ws("-", birthYear, birthMonth, birthDay), "00:00:00")
where birthYear is not null and birthMonth is not null and birthDay is not null;

update People 
set deathDate = timestamp(concat_ws("-", deathYear, deathMonth, deathDay), "00:00:00")
where deathYear is not null and deathMonth is not null and deathDay is not null;
~~~~~

#### Tests

In [24]:
%sql SELECT deathDate FROM people WHERE deathDate >= '2005-01-01' ORDER BY deathDate ASC LIMIT 10;

 * mysql+pymysql://root:***@localhost/lahman2019
10 rows affected.

[(datetime.datetime(2005, 1, 4, 0, 0),),
 (datetime.datetime(2005, 1, 7, 0, 0),),
 (datetime.datetime(2005, 1, 9, 0, 0),),
 (datetime.datetime(2005, 1, 10, 0, 0),),
 (datetime.datetime(2005, 1, 21, 0, 0),),
 (datetime.datetime(2005, 1, 22, 0, 0),),
 (datetime.datetime(2005, 1, 31, 0, 0),),
 (datetime.datetime(2005, 2, 4, 0, 0),),
 (datetime.datetime(2005, 2, 8, 0, 0),),
 (datetime.datetime(2005, 2, 11, 0, 0),)]

In [25]:
%sql SELECT birthDate FROM people WHERE birthDate <= '1965-01-01' ORDER BY birthDate ASC LIMIT 10;

 * mysql+pymysql://root:***@localhost/lahman2019
10 rows affected.

[(datetime.datetime(1820, 4, 17, 0, 0),),
 (datetime.datetime(1824, 10, 5, 0, 0),),
 (datetime.datetime(1832, 2, 25, 0, 0),),
 (datetime.datetime(1832, 9, 17, 0, 0),),
 (datetime.datetime(1832, 10, 23, 0, 0),),
 (datetime.datetime(1835, 1, 10, 0, 0),),
 (datetime.datetime(1836, 2, 29, 0, 0),),
 (datetime.datetime(1837, 12, 26, 0, 0),),
 (datetime.datetime(1838, 3, 10, 0, 0),),
 (datetime.datetime(1838, 7, 16, 0, 0),)]

### Final CREATE Statement

To find the create statement:

- Right click on the table name in workbench
- Select 'Copy to Clipboard'
- Select 'Create Statement' 

The create statement will now be copied into your clipboard and can be pasted into the cell below.

~~~~sql
CREATE TABLE `People` (
  `playerID` varchar(15) NOT NULL,
  `birthYear` char(4) DEFAULT NULL,
  `birthMonth` char(2) DEFAULT NULL,
  `birthDay` char(2) DEFAULT NULL,
  `birthCountry` varchar(128) DEFAULT NULL,
  `birthState` varchar(128) DEFAULT NULL,
  `birthCity` varchar(128) DEFAULT NULL,
  `deathYear` char(4) DEFAULT NULL,
  `deathMonth` char(2) DEFAULT NULL,
  `deathDay` char(2) DEFAULT NULL,
  `deathCountry` varchar(128) DEFAULT NULL,
  `deathState` varchar(128) DEFAULT NULL,
  `deathCity` varchar(128) DEFAULT NULL,
  `nameFirst` varchar(128) DEFAULT NULL,
  `nameLast` varchar(128) DEFAULT NULL,
  `nameGiven` varchar(128) DEFAULT NULL,
  `weight` decimal(5,1) DEFAULT NULL,
  `height` decimal(3,1) DEFAULT NULL,
  `bats` enum('L','R','B') DEFAULT NULL,
  `throws` enum('L','R','S') DEFAULT NULL,
  `debut` date DEFAULT NULL,
  `finalGame` date DEFAULT NULL,
  `retroID` varchar(10) DEFAULT NULL,
  `bbrefID` varchar(10) DEFAULT NULL,
  `isDead` enum('Y','N') DEFAULT NULL,
  `birthDate` datetime DEFAULT NULL,
  `deathDate` datetime DEFAULT NULL,
  PRIMARY KEY (`playerID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
~~~~

<hr style="height:2px">

## Batting Table

### 1) Convert all empty strings to NULL

#### Explanation

We want to convert the original "nan" string in the table to NULL type so that we can conduct following operations.

#### Change

I set values in all columns to NULL is their value is "nan". NULLIF() is used in my queries. NULLIF(expr1, expr2) returns NULL if exrp1 is equal to expr2.

#### SQL

~~~~sql
update Batting
set playerID = NULLIF(playerID, "nan"), yearID = NULLIF(yearID, "nan"), stint = NULLIF(stint, "nan"),
teamID = NULLIF(teamID, "nan"), lgID = NULLIF(lgID, "nan"), G = NULLIF(G, "nan"),
AB = NULLIF(AB, "nan"), R = NULLIF(R, "nan"), H = NULLIF(H, "nan"), 
2B = NULLIF(2B, "nan"), 3B = NULLIF(3B, "nan"), HR = NULLIF(HR, "nan"), 
RBI = NULLIF(RBI, "nan"), SB = NULLIF(SB, "nan"), CS = NULLIF(CS, "nan"),
BB = NULLIF(BB, "nan"), SO = NULLIF(SO, "nan"), IBB = NULLIF(IBB, "nan"),
HBP = NULLIF(HBP, "nan"), SH = NULLIF(SH, "nan"), SF = NULLIF(SF, "nan"),
GIDP = NULLIF(GIDP, "nan");
~~~~

#### Tests

In [27]:
%sql SELECT count(*) FROM lahman2019.batting where RBI is NULL;

 * mysql+pymysql://root:***@localhost/lahman2019
1 rows affected.

[(756,)]

### 2) Change column datatypes to appropriate values (ENUM, INT, VARCHAR, DATETIME, ETC)

#### Explanation

Setting the appropriate datatype which matches real-world scenarios the most for each column helps to organize the table. Setting appropriate datatype makes it easy to look up in the table. Moreover, there are operators in the database that only recoginze certain datatype.

#### Change

Since I am rather unfamiliar with baseball, I referred to the official document of Lahman database(https://rdrr.io/cran/Lahman/man/Batting.html). <br>
Below are column names and their new datatypes with brief explanation of my choice of the appropriate datatype <br>
PlayerID: VARCHAR(15); this follows the example in 0) <br>
yearID: CHAR(4); obviously, year is of 4-char length. <br>
stint: INT; stint is the order of appearances within a season. Obviously it should be an int, which also matches TA's suggestion in Piazza post @294. <br>
teamID: CHAR(3); all teamID values in the batting table has length of 3. Thus, I set a fixed length char data type for this column. <br>
lgID: CHAR(2); according to the official document of batting table, all lgID has length of 2. Thus, I set a fixed length char of length 2 for this column. <br>
All other columns: INT; according to the official document of batting table, all these columns (such as homeruns, stolen bases, and strikeouts) should be integer values. Thus, INT datatype was used

#### SQL

~~~~sql
ALTER TABLE `lahman2019`.`Batting` 
CHANGE COLUMN `playerID` `playerID` VARCHAR(15) NULL DEFAULT NULL ,
CHANGE COLUMN `yearID` `yearID` CHAR(4) NULL DEFAULT NULL ,
CHANGE COLUMN `stint` `stint` INT NULL DEFAULT NULL ,
CHANGE COLUMN `teamID` `teamID` CHAR(3) NULL DEFAULT NULL ,
CHANGE COLUMN `lgID` `lgID` CHAR(2) NULL DEFAULT NULL ,
CHANGE COLUMN `G` `G` INT NULL DEFAULT NULL ,
CHANGE COLUMN `AB` `AB` INT NULL DEFAULT NULL ,
CHANGE COLUMN `R` `R` INT NULL DEFAULT NULL ,
CHANGE COLUMN `H` `H` INT NULL DEFAULT NULL ,
CHANGE COLUMN `2B` `2B` INT NULL DEFAULT NULL ,
CHANGE COLUMN `3B` `3B` INT NULL DEFAULT NULL ,
CHANGE COLUMN `HR` `HR` INT NULL DEFAULT NULL ,
CHANGE COLUMN `RBI` `RBI` INT NULL DEFAULT NULL ,
CHANGE COLUMN `SB` `SB` INT NULL DEFAULT NULL ,
CHANGE COLUMN `CS` `CS` INT NULL DEFAULT NULL ,
CHANGE COLUMN `BB` `BB` INT NULL DEFAULT NULL ,
CHANGE COLUMN `SO` `SO` INT NULL DEFAULT NULL ,
CHANGE COLUMN `IBB` `IBB` INT NULL DEFAULT NULL ,
CHANGE COLUMN `HBP` `HBP` INT NULL DEFAULT NULL ,
CHANGE COLUMN `SH` `SH` INT NULL DEFAULT NULL ,
CHANGE COLUMN `SF` `SF` INT NULL DEFAULT NULL ,
CHANGE COLUMN `GIDP` `GIDP` INT NULL DEFAULT NULL ;
~~~~

### 3) Add a Primary Key
Two options for the Primary Key:

- Composite Key: playerID, yearID, stint
- Covering Key: playerID, yearID, stint, teamID


#### Choice

Composite Key: playerID, yearID, stint is a better choice. <br>
Primary key should contain minimal columns that can uniquely identify rows in a table. Having extra columns causes waste in terms of index space used. Moreover, having extra columns in primary key might introduce redudant dependencies, which might cause anomalies and incorrect results. <br>
In our case, since playerID, yearID and stint combined can already uniquely identify rows in the batting table, there's no need to add teamID into the primary key set. This also helps us to look up the table more easily (as less information is needed to locate a row).  Thus, I set playerID, yearID, and stint column as primary key.

#### Explanation

We want to add a Primary Key because we want to be able to uniquely identify rows within our data. A primary key is also an index, which allows us to locate data faster.

#### SQL

ALTER TABLE `lahman2019`.`Batting` 
CHANGE COLUMN `playerID` `playerID` VARCHAR(15) NOT NULL ,
CHANGE COLUMN `yearID` `yearID` CHAR(4) NOT NULL ,
CHANGE COLUMN `stint` `stint` INT NOT NULL ,
ADD PRIMARY KEY (`playerID`, `yearID`, `stint`);
;

#### Test

In [28]:
%sql SHOW KEYS FROM batting WHERE Key_name = 'PRIMARY' and Column_name = 'playerID'

 * mysql+pymysql://root:***@localhost/lahman2019
1 rows affected.

[('Batting', 0, 'PRIMARY', 1, 'playerID', 'A', 20644, None, None, '', 'BTREE', '', '', 'YES', None)]

### 4) Add a foreign key on playerID between the People and Batting Tables
Note: Two people in the batting table do not exist in the people table. How should you handle this issue?

#### Explanation

Since playerID is the primary key in People tables, adding foreign key on playerID can connect the People and Batting tables effectively, which will help us to look up or manipulate the tables in the future.

#### Change

I added a constraint called "batting_to_people" so that the playerID column in Batting table references to the playerID column in People table.

#### SQL

~~~~sql
ALTER TABLE `lahman2019`.`Batting` 
ADD CONSTRAINT `batting_to_people`
  FOREIGN KEY (`playerID`)
  REFERENCES `lahman2019`.`People` (`playerID`)
  ON DELETE NO ACTION
  ON UPDATE NO ACTION;
~~~~

#### Tests

In [29]:
%sql Select playerID from batting where playerID not in (select playerID from people);

 * mysql+pymysql://root:***@localhost/lahman2019
0 rows affected.

[]

### Final CREATE Statement

To find the create statement:

- Right click on the table name in workbench
- Select 'Copy to Clipboard'
- Select 'Create Statement' 

The create statement will now be copied into your clipboard and can be pasted into the cell below.

~~~~sql
CREATE TABLE `Batting` (
  `playerID` varchar(15) NOT NULL,
  `yearID` char(4) NOT NULL,
  `stint` int NOT NULL,
  `teamID` char(3) DEFAULT NULL,
  `lgID` char(2) DEFAULT NULL,
  `G` int DEFAULT NULL,
  `AB` int DEFAULT NULL,
  `R` int DEFAULT NULL,
  `H` int DEFAULT NULL,
  `2B` int DEFAULT NULL,
  `3B` int DEFAULT NULL,
  `HR` int DEFAULT NULL,
  `RBI` float DEFAULT NULL,
  `SB` float DEFAULT NULL,
  `CS` float DEFAULT NULL,
  `BB` int DEFAULT NULL,
  `SO` float DEFAULT NULL,
  `IBB` float DEFAULT NULL,
  `HBP` float DEFAULT NULL,
  `SH` float DEFAULT NULL,
  `SF` float DEFAULT NULL,
  `GIDP` float DEFAULT NULL,
  PRIMARY KEY (`playerID`,`yearID`,`stint`),
  CONSTRAINT `batting_to_people` FOREIGN KEY (`playerID`) REFERENCES `People` (`playerID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
~~~~

<hr style="height:2px">

## Part 2: Career Highlights of Award Winning Players


- Find the ```playerID, firstName, lastName, number of awards, number of games played and number of home runs```, for every player.


- Group the entries by ```playerID``` and order by descending ```number of awards``` values

- You need to return 10 rows.

- Hint the ```IFNULL()``` command helps when joining tables

<u>Answer:</u>

#### Run your query

~~~~sql
select People.playerID, People.nameFirst, People.nameLast, award_table.awards, app.gamesPlayed, hrs.homeRuns from People 
join (select playerID, count(*) as awards from AwardsPlayers group by playerID) as award_table 
join (select playerID, sum(G_all) as gamesPlayed from Appearances group by PlayerID) as app
join (select playerID, sum(HR) as homeRuns from Batting group by playerID) as hrs
on People.playerID = award_table.playerID and award_table.playerID = app.playerID and app.playerID = hrs.playerID
order by award_table.awards desc;
~~~~

#### Expected output

In [46]:
%sql select People.playerID, People.nameFirst, People.nameLast, award_table.awards, \
app.gamesPlayed, hrs.homeRuns from People join (select playerID, count(*) as awards from AwardsPlayers group by playerID) as award_table join (select playerID, sum(G_all) as gamesPlayed from Appearances group by PlayerID) as app join (select playerID, sum(HR) as homeRuns from Batting group by playerID) as hrs on People.playerID = award_table.playerID and award_table .playerID = app.playerID and app.playerID = hrs.playerID group by playerID order by award_table.awards desc limit 10;

 * mysql+pymysql://root:***@localhost/lahman2019
10 rows affected.

[('bondsba01', 'Barry', 'Bonds', 47, 2986.0, Decimal('762')),
 ('willite01', 'Ted', 'Williams', 39, 2292.0, Decimal('521')),
 ('dimagjo01', 'Joe', 'DiMaggio', 36, 1736.0, Decimal('361')),
 ('musiast01', 'Stan', 'Musial', 34, 3026.0, Decimal('475')),
 ('ruthba01', 'Babe', 'Ruth', 33, 2504.0, Decimal('714')),
 ('johnswa01', 'Walter', 'Johnson', 33, 937.0, Decimal('24')),
 ('schmimi01', 'Mike', 'Schmidt', 33, 2404.0, Decimal('548')),
 ('robinbr01', 'Brooks', 'Robinson', 32, 2896.0, Decimal('268')),
 ('mayswi01', 'Willie', 'Mays', 32, 2992.0, Decimal('660')),
 ('cobbty01', 'Ty', 'Cobb', 31, 3034.0, Decimal('117'))]